tutorials/lagrangian/rhoPisoTwinParcelFoam/simplifiedSiwek/0/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1.0;
        value           uniform 0;
    }
    bottom
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1.0;
        value           uniform 0;
    }
    walls
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1.0;
        value           uniform 0;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
